<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>PayloadType</key>
            <string>com.apple.ManagedClient.preferences</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>PayloadIdentifier</key>
            <string>com.zerotrace.agent.config</string>
            <key>PayloadDisplayName</key>
            <string>ZeroTrace Agent Configuration</string>
            <key>PayloadDescription</key>
            <string>Configures ZeroTrace Agent settings</string>
            <key>PayloadOrganization</key>
            <string>ZeroTrace</string>
            <key>PayloadScope</key>
            <string>System</string>
            <key>PayloadRemovalDisallowed</key>
            <false/>
            <key>PayloadContent</key>
            <dict>
                <key>com.zerotrace.agent</key>
                <dict>
                    <key>Forced</key>
                    <array>
                        <dict>
                            <key>mcx_preference_settings</key>
                            <dict>
                                <key>EnrollmentToken</key>
                                <string>${ENROLLMENT_TOKEN}</string>
                                <key>APIURL</key>
                                <string>${API_URL}</string>
                                <key>OrganizationID</key>
                                <string>${ORG_ID}</string>
                            </dict>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadIdentifier</key>
    <string>com.zerotrace.agent</string>
    <key>PayloadUUID</key>
    <string>87FB3AC4-E8A1-4C51-9872-4393C6AA67D6</string>
    <key>PayloadDisplayName</key>
    <string>ZeroTrace Agent</string>
    <key>PayloadDescription</key>
    <string>ZeroTrace Agent Configuration</string>
    <key>PayloadOrganization</key>
    <string>ZeroTrace</string>
</dict>
</plist>
